MAJORS = (
    ('総合学類', '総合学類'),
    ('人文学類', '人文学類'),
    ('比較文化学類', '比較文化学類'),
    ('日本語・日本文化学類', '日本語・日本文化学類'),
    ('社会学類', '社会学類'),
    ('国際総合学類', '国際総合学類'),
    ('教育学類', '教育学類'),
    ('心理学類', '心理学類'),
    ('障害科学類', '障害科学類'),
    ('生物学類', '生物学類'),
    ('生物資源学類', '生物資源学類'),
    ('地球学類', '地球学類'),
    ('数学類', '数学類'),
    ('物理学類', '物理学類'),
    ('化学類', '化学類'),
    ('応用理工学類', '応用理工学類'),
    ('工学システム学類', '工学システム学類'),
    ('社会工学類', '社会工学類'),
    ('情報科学類', '情報科学類'),
    ('情報メディア創成学類', '情報メディア創成学類'),
    ('知識情報図書館学類', '知識情報図書館学類'),
    ('医学類', '医学類'),
    ('医療科学類', '医療科学類'),
    ('看護学類', '看護学類'),
    ('体育専門学群', '体育専門学群'),
    ('芸術専門学群', '芸術専門学群'),
)

PREFECTURES = (
    ('東北', '東北'),
    ('関東', '関東'),
    ('東海', '東海'),
    ('中越', '中越'),
    ('近畿', '近畿'),
    ('中国', '中国'),
    ('四国', '四国'),
    ('九州', '九州'),
)

MUSICLIST = (
    ('JPOP', 'JPOP'),
    ('洋楽', '洋楽'),
    ('KPOP', 'KPOP'),
    ('HIPHOP', 'HIPHOP'),
    ('クラシック', 'クラシック'),
    ('EDM', 'EDM'),
    ('アニソン', 'アニソン'),
    ('ロック', 'ロック'),
    ('その他', 'その他')
)

ANIMELIST = (
    ('きらら系', 'きらら系'),
    ('バトル系', 'バトル系'),
    ('日常系', '日常系'),
    ('スポーツ系', 'スポーツ系'),
    ('なろう系', 'なろう系'),
    ('ロボット系', 'ロボット系'),
    ('その他', 'その他'),
)

MOVIELIST = (
    ('アクション', 'アクション'),
    ('恋愛', '恋愛'),
    ('SF', 'SF'),
    ('コメディ', 'コメディ'),
    ('ホラー', 'ホラー'),
    ('サスペンス', 'サスペンス'),
    ('その他', 'その他'),
)

RAMENLIST = (
    ('むじゃき', 'むじゃき'),
    ('伊堂寺', '伊堂寺'),
    ('真壁屋', '真壁屋'),
    ('鶏々', '鶏々'),
    ('龍郎', '龍郎'),
    ('その他', 'その他'),
)

SPORTLIST = (
    ('野球', '野球'),
    ('サッカー', 'サッカー'),
    ('バスケ', 'バスケ'),
    ('バレーボール', 'バレーボール'),
    ('バドミントン', 'バドミントン'),
    ('テニス', 'テニス'),
    ('武道', '武道'),
    ('その他', 'その他'),
)

GAMELIST = (
    ('アクション', 'アクション'),
    ('RPG', 'RPG'),
    ('シミュレーション', 'シミュレーション'),
    ('バカゲー', 'バカゲー'),
    ('FPS', 'FPS'),
    ('ストラテジー', 'ストラテジー'),
    ('ローグライク', 'ローグライク'),
    ('その他', 'その他'),
)